n = int(input("Введите трёхзначное число: "))

d1 = n // 100
d2 = n % 100 // 10
d3 = n % 10
 
print("Сумма цифр числа: ",d1 + d2 + d3)
#//////////////////////////////
n = input("Введите трёхзначное число: ")
Length = len(n)
n = int(n)

res = (n//100 + n//10%10 + n%10)

if Length == 3: 
    print(res)
else: 
    print("Вы ввели неверное число.")
#///////////////////////

n = 1231

res = (n//100 + n//10%10 + n%10)

if n > 999 or n < 100: 
    print("Вы ввели неверное число.")
else: 
    print(res)